[UCX]
btn_UCX_make=LMB: Создать UCX-контейнеры выпуклых произвольных форм, описывающих силуэты вокруг выбранных частей объектов::LMB+CTRL: Делать сначала Remesh выделению с указанной максимальной длинной ребер::LMB+ALT: Не обводить объекты::LMB+SHIFT: Добавить Push в стек::::RMB: Создать UCX-контейнер вокруг выбранных граней-элементов объекта::::RMB+CTRL: габариты +0,005м | LMB: Create UCX containers of convex arbitrary shapes that describe the silhouettes around the selected parts of the objects::LMB+CTRL: Remesh the selection first with the specified maximum edge length::LMB+ALT: Do not outline the objects::LMB+SHIFT: Add Push to the stack::::RMB: Make UCX box around selected faces-elements of object::::LMB+CTRL: make gabarites offset 0.005m
spn_UCX_make=Максимальная длинна ребер для операции Remesh. По умолчанию 0 - оставлять модель как есть. При подобранных положительных значениях происходит Remesh выбранной части модели на эту величину длинны ребер, таким образом, что уменьшенный полигонаж Remesh модели влияет на полигонаж создаваемой UCX формы вокруг Remesh модели | Maximum edge length for the Remesh operation. The default value is 0, which leaves the model as it is. When a positive value is selected, the selected part of the model is remeshed by the specified edge length, resulting in a reduced polygon count for the Remesh model, which affects the polygon count of the UCX shape created around the Remesh model
btn_UCX_makeground=Создать контейнеры UCX из выбранных граней Ground объекта. Используется автоматическое разбиение для выпукло-вогнутых мест, зазоры и выдавливание вниз | Make UCX containers from selected faces from Ground object. Use automatic Convex-Concave subdivision, gaps and extrusions
btn_UCX_gaps=LMB: сделать зазоры между несколькими выделенными объектами путем булевых операций с отступом, могут продуцироваться вогнутые формы, возможно придется повторно создавать UCX-контейнеры выпуклых форм | LMB: Make gaps between multiple selected UCX objects using Boolean operations with padding, which may produce concave shapes and may require re-creating UCX containers for convex shapes
btn_UCX_check=LMB: Проверить UCXы на максимальное количество треугольников::LMB+CTRL: Не триангулировать при проверке::::RMB: Проверить UCXы на наличие пересечений::RMB+ALT: Детальная проверка::RMB+CTRL: Проверить UCX-формы на ВЫПУКЛОСТЬ (правильную) и ВОГНУТОСТЬ (неправильную) | LMB: Check UCXs for maximum triangles::LMB+CTRL: Don't triangulate::::RMB: Check UCXs for intersections::RMB+ALT: Detailed check::RMB+CTRL: Check UCXs forms for CONVEX (right) and CONCAVE (wrong)
btn_UCX_rename=Переименовать выбранные объекты UCX по номерам | Rename selected UCX objects by numbers
btn_UCX_Clear_Mat=Удалить материал у выбранных UCX объектов | Delete UCX Material on selected objects
btn_UCX_move=LMB: Раздвинуть параллельные грани на расстояние [0,01 - 0,02], обычно на расстояние 0,015 м друг от друга::::LMB+ALT: также раздвинуть близкие вершины и ребра::::LMB+CTRL: дополнительно использовать точки с нормалями к центрам граней, для большей точности | LMB: Move parallel faces to range [0.01 - 0.02], usually to 0.015m from each other::::LMB+ALT: also moves near verts and edges (do not use with faces - will move twice)::::LMB+CTRL: additional use verts points with face centers normals, for more accuracy
btn_UCX_explode=LMB: Разделить Editable Poly (UCX) на элементы::::RMB: Объединить все объекты в один Editable Poly | LMB: Explode Editable Poly to elements::::RMB: attach all objects in one Editable Poly
btn_UCX_connect=Триангулировать выбранные объекты UCX | Triangulate selected UCX objects
btn_UCX_Select=LMB: Выбрать все UCX (поиск по имени) для предварительно выбранной ВПМ модели::::RMB: Выбрать все UCX модели из одного или нескольких выбранных UCX | LMB: Select all UCXs for preselected model (by name)::::RMB: Select all the same UCXs from one or few selected UCX
btn_UCX_Hide=Скрыть все объекты UCX (поиск по имени) | Hide all UCX objects by name
btn_UCX_Unhide=Показать все объекты UCX (поиск по имени) | Unhide all UCX objects by name



